# GetExportLineweightInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTable..::..GetExportLineweightInfo Method
ExportLineweightTable Class See Also
---
Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportLineweightInfo GetExportLineweightInfo(
	ExportLineweightKey exportLineweightKey
)
```

Visual Basic
---
```text
Public Function GetExportLineweightInfo ( _
	exportLineweightKey As ExportLineweightKey _
) As ExportLineweightInfo
```

Visual C++
---
```text
public:
ExportLineweightInfo^ GetExportLineweightInfo(
	ExportLineweightKey^ exportLineweightKey
)
```

# ### Parameters
exportLineweightKey
    Type: Autodesk.Revit.DB..::..ExportLineweightKey The export line weight Key.
# ### Return Value
Returns the line weight info for this key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | An entry with the given key is not present in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace